import { defineConfig } from "vitepress";

export default defineConfig({
  title: "Beekeeper",
  description: "Документация симулятора пасечника",
  base: "/docs/",
  themeConfig: {
    sidebar: [
      {
        text: "Геймдизайн",
        items: [
          {
            text: "Пчелы",
            collapsed: true,
            items: [
              { text: "Классы пчел", link: "/01 Геймдизайн/Пчелы/Классы пчел" },
              {
                text: "Формулы для пчел",
                link: "/01 Геймдизайн/Пчелы/Формулы для пчел",
              },
              {
                text: "Индикаторы для игрока",
                link: "/01 Геймдизайн/Пчелы/Индикаторы для игрока",
              },
            ],
          },
          {
            text: "Базовая система инвентаря",
            link: "/01 Геймдизайн/Базовая система инвентаря",
          },
          {
            text: "Взаимодействие с ульем",
            link: "/01 Геймдизайн/Взаимодействие с ульем",
          },
          {
            text: "Геймплей вертикального среза",
            link: "/01 Геймдизайн/Геймплей вертикального среза",
          },
          { text: "Интерфейс", link: "/01 Геймдизайн/Интерфейс" },
          {
            text: "Покупка улучшения",
            link: "/01 Геймдизайн/Покупка улучшения",
          },
          {
            text: "Реализация иммерсивности",
            link: "/01 Геймдизайн/Реализация иммерсивности",
          },
          { text: "Система ульев", link: "/01 Геймдизайн/Система ульев" },
          {
            text: "Точка продажи продукта",
            link: "/01 Геймдизайн/Точка продажи продукта",
          },
        ],
      },
      {
        text: "Нарратив и сценарий",
        items: [
          {
            text: "Атмосферный квест",
            link: "/02 Нарратив и сценарий/Атмосферный квест",
          },
          {
            text: "Вступительная сцена",
            link: "/02 Нарратив и сценарий/Вступительная сцена",
          },
          {
            text: "Ключевой НПС",
            link: "/02 Нарратив и сценарий/Ключевой НПС",
          },
          {
            text: "Минимальная система целей квестов",
            link: "/02 Нарратив и сценарий/Минимальная система целей квестов",
          },
          {
            text: "Эмоциональная развязка",
            link: "/02 Нарратив и сценарий/Эмоциональная развязка",
          },
        ],
      },
      {
        text: "Левел-дизайн",
        items: [
          {
            text: "Визуальные ориентиры и навигация",
            link: "/03 Левел-дизайн/Визуальные ориентиры и навигация",
          },
          {
            text: "Вторичная локация",
            link: "/03 Левел-дизайн/Вторичная локация",
          },
          {
            text: "Локация-намек на продолжение",
            link: "/03 Левел-дизайн/Локация-намек на продолжение",
          },
          {
            text: "Общая концепция карты",
            link: "/03 Левел-дизайн/Общая концепция карты",
          },
          {
            text: "Простейшая динамика мира",
            link: "/03 Левел-дизайн/Простейшая динамика мира",
          },
          { text: "Сборка локации", link: "/03 Левел-дизайн/Сборка локации" },
          {
            text: "Центральная локация",
            link: "/03 Левел-дизайн/Центральная локация",
          },
        ],
      },
      {
        text: "Визуальный язык",
        items: [
          {
            text: "UI/UX",
            collapsed: true,
            items: [
              {
                text: "ТЗ на UI/UX",
                link: "/04 Визуальный язык/UI UX/ТЗ на UI UX",
              },
            ],
          },
          {
            text: "Интерфейс игры",
            link: "/04 Визуальный язык/Интерфейс игры",
          },
          {
            text: "Ключевые объекты",
            link: "/04 Визуальный язык/Ключевые объекты",
          },
          {
            text: "Определение визуального стиля",
            link: "/04 Визуальный язык/Определение визуального стиля",
          },
          { text: "Персонажи", link: "/04 Визуальный язык/Персонажи" },
          {
            text: "Сборка визуала",
            link: "/04 Визуальный язык/Сборка визуала",
          },
          {
            text: "Фоны и окружение",
            link: "/04 Визуальный язык/Фоны и окружение",
          },
          {
            text: "Цветовая палитра и освещение",
            link: "/04 Визуальный язык/Цветовая палитра и освещение",
          },
        ],
      },
      {
        text: "Аудио",
        items: [
          {
            text: "Атмосферный фон (эмбиент)",
            link: "/05 Аудио/Атмосферный фон (эмбиент)",
          },
          {
            text: "Баланс и микширование",
            link: "/05 Аудио/Баланс и микширование",
          },
          { text: "Звуки действий", link: "/05 Аудио/Звуки действий" },
          { text: "Звуки пчел", link: "/05 Аудио/Звуки пчел" },
          { text: "Музыка", link: "/05 Аудио/Музыка" },
        ],
      },
      {
        text: "Управление проектом",
        items: [
          {
            text: "База знаний проекта",
            link: "/06 Управление проектом/База знаний проекта",
          },
          {
            text: "Глоссарий терминов",
            link: "/06 Управление проектом/Глоссарий терминов",
          },
          {
            text: "Декомпозиция вертикального среза",
            link: "/06 Управление проектом/Декомпозиция вертикального среза",
          },
          {
            text: "Завершение вертикального среза",
            link: "/06 Управление проектом/Завершение вертикального среза",
          },
          {
            text: "Карточка One-Pager",
            link: "/06 Управление проектом/Карточка One-Pager",
          },
          {
            text: "Че делать вообще",
            link: "/06 Управление проектом/Че делать вообще",
          },
        ],
      },
      {
        text: "Сервер",
        items: [
          {
            text: "Введение",
            link: "/Сервер/Введение"
          },
          {
            text: "Документация",
            link: "/Сервер/Документация"
          }
        ],
      }
    ],
    socialLinks: [
      { icon: "github", link: "https://github.com/Beekeeper-Company/docs" },
    ],
  },
});
